# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [21]:
series1 = pd.Series(np.random.randint(1,5,100))
series2 = pd.Series(np.random.randint(1,4,100))
series3 = pd.Series(np.random.randint(10000,30001,100))

In [25]:
series1

0     3
1     1
2     4
3     3
4     3
     ..
95    3
96    1
97    4
98    1
99    2
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [28]:
#stack series horizontally to make multiple columns
df = pd.concat([series1, series2, series3],axis='columns')

In [29]:
df

    0  1      2
0   3  2  25176
1   1  3  20543
2   4  3  25711
3   3  3  27700
4   3  2  11905
.. .. ..    ...
95  3  2  23485
96  1  1  27935
97  4  3  19063
98  1  3  23060
99  2  1  19710

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [34]:

df.rename(columns = {
    0: 'bedrs',
    1: 'bathrs',
    2: 'price_sqr_meter'
})

    bedrs  bathrs  price_sqr_meter
0       3       2            25176
1       1       3            20543
2       4       3            25711
3       3       3            27700
4       3       2            11905
..    ...     ...              ...
95      3       2            23485
96      1       1            27935
97      4       3            19063
98      1       3            23060
99      2       1            19710

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [57]:
#stack series vertically to make on column
bigcolumn = pd.concat([series1, series2, series3], axis = 'index')

In [58]:
type(bigcolumn)

pandas.core.series.Series

In [59]:
bigcolumn = bigcolumn.to_frame()

In [60]:
type(bigcolumn)

pandas.core.frame.DataFrame

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [61]:
bigcolumn

        0
0       3
1       1
2       4
3       3
4       3
..    ...
95  23485
96  27935
97  19063
98  23060
99  19710

[300 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [62]:
#drop =True removes the old indices
bigcolumn.reset_index(drop=True, inplace=True)

In [63]:
bigcolumn

         0
0        3
1        1
2        4
3        3
4        3
..     ...
295  23485
296  27935
297  19063
298  23060
299  19710

[300 rows x 1 columns]